import Kyiv from "../../assets/Kyiv.svg";
import Lviv from "../../assets/Lviv.svg";
import Odessa from "../../assets/Odessa.svg";
import User from "../../assets/UserIcon.svg";

const HowItWOrk = [
  {
    TabPanele_title: "💻 Для донорів",
    title_of_the_tab: "Як це працює для донорів?",
    text_of_the_tab: [
      {
        text: "📜 Зареєструйтеся та виберіть волонтера.",
      },
      {
        text: "📦 Відправте ноутбук волонтера.",
      },
      {
        text: "🎥 Отримайте відеопідтвердження передачі.",
      },
    ],
  },
  {
    TabPanele_title: "🎖️ Для ветеранів",
    title_of_the_tab: "Як це працює для ветеранів?",
    text_of_the_tab: [
      {
        text: "📝 Зареєструйтеся для отримання ноутбука.",
      },
      {
        text: "🚚 Отримайте доставку від волонтера.",
      },
      {
        text: "🖥️ Почніть навчання на новому ноутбуці.",
      },
    ],
  },
  {
    TabPanele_title: "🤝 Для волонтерів",
    title_of_the_tab: "Як це працює для волонтерів?",
    text_of_the_tab: [
      {
        text: "✍️ Реєструйтесь у проєкті.",
      },
      {
        text: "📨 Отримайте ноутбук від донора.",
      },
      {
        text: "📹 Зніміть передачу та надішліть відеозвіт.",
      },
    ],
  },
];

const HowItGet = [
  {
    TabPanele_title: "Київська область",
    images: [
      {
        img: Kyiv,
        alt: "Київська область",
      },
    ],
    CountOfVolunteers: "4 волонтерів",
    CountOfLaptops: "3 ноутбука",
    title_of_the_tab: "Отримайте доступ до CRM волонтерів",
    title_of_the_tab_to_order_laptop: "Замовити ноутбук і розпочати навчання",
    text_of_the_tab: [
      { text: "Станьте першим щоб отримати ноутбук", user_Icon: User },
      { text: "Станьте першим щоб отримати ноутбук", user_Icon: User },
      { text: "Станьте першим щоб отримати ноутбук", user_Icon: User },
    ],
    type_of_laptop: [
      {
        name: "MacBook Air M1 512GB",
        user_Icon: [
          {
            img: User,
            alt: "User",
          },
        ],
      },
    ],
    text_overview: [
      {
        text: "Потужний ноутбук на базі M1, ідеально підходить для багатозадачності та творчих завдань.",
      },
    ],
    user_Icon: [
      {
        img: User,
        alt: "User",
      },
    ],
    type_of_laptop: [
      {
        name: "Lenovo V130-14IKB",
        user_Icon: [
          {
            img: User,
            alt: "User",
          },
        ],
      },
    ],
    text_overview: [
      {
        text: "Ноутбук для офісних завдань, з Core i5, 8GB RAM і SSD 256GB. Підходить для бізнесу та навчання",
      },
    ],
  },
  {
    TabPanele_title: "Львівська область",
    images: [
      {
        img: Lviv,
        alt: "Львівська область",
      },
    ],
    CountOfVolunteers: "6 волонтерів",
    CountOfLaptops: "5 ноутбука",
    title_of_the_tab: "Отримайте доступ до CRM волонтерів",
    title_of_the_tab_to_order_laptop: "Замовити ноутбук і розпочати навчання",
    text_of_the_tab: [
      { text: "Станьте першим щоб отримати ноутбук", user_Icon: User },
      { text: "Станьте першим щоб отримати ноутбук", user_Icon: User },
      { text: "Станьте першим щоб отримати ноутбук", user_Icon: User },
    ],
    type_of_laptop: [
      {
        name: "Lenovo V130-14IKB",
        user_Icon: [
          {
            img: User,
            alt: "User",
          },
        ],
      },
    ],
    text_overview: [
      {
        text: "Ноутбук для офісних завдань, з Core i5, 8GB RAM і SSD 256GB. Підходить для бізнесу та навчання",
      },
    ],
  },
  {
    TabPanele_title: "Одеська область",
    images: [
      {
        img: Odessa,
        alt: "Одеська область",
      },
    ],
    CountOfVolunteers: "8 волонтерів",
    CountOfLaptops: "9 ноутбука",
    title_of_the_tab: "Отримайте доступ до CRM волонтерів",
    title_of_the_tab_to_order_laptop: "Замовити ноутбук і розпочати навчання",
    text_of_the_tab: [
      { text: "Станьте першим щоб отримати ноутбук", user_Icon: User },
      { text: "Станьте першим щоб отримати ноутбук", user_Icon: User },
      { text: "Станьте першим щоб отримати ноутбук", user_Icon: User },
    ],
    type_of_laptop: [
      {
        name: "Asus Windows 11",
        user_Icon: [
          {
            img: User,
            alt: "User",
          },
        ],
      },
    ],
    text_overview: [
      {
        text: "Новий ноутбук з Windows 11, підходить для базових завдань і повсякденного використання.",
      },
    ],
  },
];

const FormQuestion = {
  title: "Підключайтесь до нашого благодійного проекту *",
  questions: [
    {
      id: 1,
      question: "Я ветеран, мені потрібний ноутбук для навчання",
    },
    {
      id: 2,
      question: "Я волонтер, готовий доставити ноутбук ветерану",
    },
    {
      id: 3,
      question: "Я хочу подарувати свій старий ноутбук ветерану",
    },
    {
      id: 4,
      question: "Я представник організації, ми бажаємо допомогти",
    },
    {
      id: 5,
      question: "Я просто хочу повідомити вам щось важливе",
    },
  ],
  // Accordion: [
  //   {Veterans:[
  //     TitleOfAccordion:"Як запакувати ноутбук для відправки?",
  //     Answers:"Рекомендуємо використовувати міцну упаковку та обгорнути ноутбук захисним матеріалом, щоб уникнути пошкоджень при доставці."
  //   ]}
  //   ],
};

const AccordionData = {
  donors: [
    {
      title: "Як запакувати ноутбук для відправки?",
      content:
        "Рекомендуємо використовувати міцну упаковку та обгорнути ноутбук захисним матеріалом, щоб уникнути пошкоджень при доставці.",
    },
    {
      title: "Чи можу я відстежувати посилку?",
      content:
        "Так, після відправки ви отримаєте номер для відстеження, щоб перевірити статус доставки.",
    },
    {
      title: "Як обрати волонтера для відправки?",
      content:
        "Ви можете обрати волонтера за його місцем розташування або за кількістю ветеранів, які потребують ноутбуків у його регіоні.",
    },
  ],
  veterans: [
    {
      title: "Як отримати ноутбук?",
      content:
        "Зареєструйтесь на платформі, оберіть пункт прийому та чекайте, поки волонтер зв’яжеться з вами для передачі ноутбука.",
    },
    {
      title: "Чи є ноутбуки безкоштовними?",
      content:
        "Так, усі ноутбуки надаються безкоштовно для ветеранів, які бажають розвивати свої ІТ-навички.",
    },
    {
      title: "Що робити, якщо ноутбук має несправності?",
      content:
        "Якщо ноутбук має технічні проблеми, зв’яжіться з волонтером для заміни або ремонту.",
    },
  ],
  volunteers: [
    {
      title: "Як отримати ноутбук від донора?",
      content:
        "Після реєстрації волонтера, ви отримаєте повідомлення про відправку ноутбука донором. Ви зможете отримати його на пошті.",
    },
    {
      title: "Чи можу я відправити ноутбук ветерану поштою?",
      content:
        "Так, ви можете домовитися з ветераном про пересилку, якщо особиста передача не є можливою.",
    },
    {
      title: "Які звіти потрібно надіслати після передачі ноутбука?",
      content:
        "Після передачі ноутбука, зніміть відео підтвердження та надішліть його через CRM для звітування.",
    },
  ],
};

export { HowItWOrk, HowItGet, FormQuestion, AccordionData };
